const map = L.map('map').setView([43.2220, 76.8512], 12); 

L.tileLayer('https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png', { 
    maxZoom: 19, 
    attribution: '© OpenStreetMap' 
}).addTo(map); 

var markerLayer = L.layerGroup().addTo(map);

const recyclingIcon = L.divIcon({
    className: 'recycling-icon', 
    html: `
        <svg height="40px" width="40px" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 512 512" xml:space="preserve" fill="#000000">
            <g id="SVGRepo_bgCarrier" stroke-width="0"></g>
            <g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g>
            <g id="SVGRepo_iconCarrier"> 
                <g> 
                    <path style="fill:#CFF09E;" d="M217.562,316.1h-0.57c-6.703,0-12.138,5.434-12.138,12.138v17.884H39.794l54.599,94.367c5.721,9.889,16.278,15.977,27.702,15.977h82.759v17.875c0,6.703,5.434,12.138,12.138,12.138h0.014c3.22,0,6.306-1.278,8.583-3.556l73.329-73.329c4.741-4.741,4.74-12.427-0.001-17.167l-46.318-46.304l-26.452-26.464C223.869,317.379,220.781,316.1,217.562,316.1z"></path> 
                    <path style="fill:#CFF09E;" d="M225.126,195.671l0.279-0.486c3.341-5.812,1.337-13.233-4.477-16.572l-15.507-8.91l50.753-88.295l31.514-54.83v-1.053H185.967c-15.92,0-30.606,8.567-38.446,22.422l-37.763,66.758l-15.501-8.907c-5.811-3.338-13.228-1.337-16.569,4.474l-0.007,0.012c-1.605,2.791-2.036,6.106-1.196,9.215l9.755,36.129l17.27,63.981c1.746,6.472,8.409,10.303,14.882,8.555l99.375-26.821C220.874,200.502,223.522,198.463,225.126,195.671z"></path> 
                </g> 
                <g> 
                    <path style="fill:#507C5C;" d="M504.158,261.281l-30.74-53.474l2.501-1.437c6.286-3.614,10.789-9.461,12.678-16.463c1.889-7.002,0.936-14.319-2.681-20.604c-3.613-6.279-9.453-10.777-16.448-12.666l-100.128-27.04c-6.997-1.89-14.316-0.941-20.601,2.672s-10.787,9.458-12.678,16.457l-26.821,99.36c-1.89,7-0.941,14.316,2.675,20.605l0.279,0.483c7.457,12.973,24.079,17.464,37.052,10.007l15.5-8.906c7.185-4.127,9.662-13.299,5.533-20.482c-4.127-7.185-13.299-9.662-20.482-5.533l-9.994,5.742l24.481-90.686l90.685,24.488l-9.512,5.469c-3.449,1.983-5.97,5.256-7.008,9.096c-1.038,3.841-0.506,7.938,1.478,11.387l38.217,66.48c5.149,8.957,5.155,20.088,0.014,29.049l-37.949,66.158l-38.606-67.16c-4.129-7.184-13.302-9.658-20.484-5.532c-7.185,4.129-9.659,13.3-5.532,20.484l47.335,82.343l-14.474,25.229c-5.185,9.038-14.879,14.652-25.3,14.652h-94.884l21.259-21.259c5.127-5.127,7.95-11.942,7.95-19.192s-2.824-14.065-7.952-19.194l-72.764-72.764c-5.127-5.13-11.944-7.955-19.197-7.955h-0.57c-14.966,0-27.141,12.175-27.141,27.141v2.881H48.208l-14.375-23.741c-5.128-8.961-5.124-20.071,0.026-29.027l47.611-82.822l7.556,27.988c3.19,11.816,13.962,20.07,26.194,20.071l0,0c2.385,0,4.766-0.315,7.08-0.941l99.372-26.821c7.002-1.889,12.847-6.393,16.455-12.672l0.284-0.494c3.613-6.285,4.561-13.602,2.671-20.601c-1.89-7-6.394-12.844-12.679-16.455l-2.497-1.434l71.067-123.644h28.815c10.409,0,20.098,5.607,25.286,14.631c2.776,4.827,7.826,7.529,13.021,7.529c2.536,0,5.107-0.644,7.464-1.998c7.183-4.129,9.659-13.3,5.53-20.484c-10.525-18.31-30.182-29.684-51.3-29.684h-38.102h-101.72c-21.286,0-41.022,11.51-51.504,30.039L104.136,94.17l-2.405-1.382c-4.111-2.361-8.783-3.611-13.512-3.611c-9.691,0-18.71,5.217-23.538,13.612c-0.009,0.017-0.02,0.035-0.03,0.054c-3.596,6.277-4.537,13.578-2.651,20.563l8.409,31.153L7.846,263.397c-10.49,18.248-10.46,40.902,0.081,59.121c0.05,0.087,0.101,0.173,0.153,0.258l19.666,32.48l53.662,92.745c8.376,14.474,23.966,23.466,40.688,23.466h67.756v2.872c0,14.966,12.175,27.141,27.141,27.141h0.014c7.25,0,14.065-2.824,19.192-7.949l22.062-22.064h124.891c21.139,0,40.807-11.39,51.326-29.727l19.106-33.307c0-0.002,0.001-0.002,0.001-0.002l50.601-88.217C514.615,302.034,514.604,279.451,504.158,261.281z"></path> 
                </g> 
            </g>
        </svg>
    `
});

var circleIcon = L.divIcon({
    className: 'circle-icon',
    //iconSize: [30, 30],
    html: `
        
    `
});


class Point {
    constructor (pos1, pos2, val, address) {
        this.pos1 = pos1;
        this.pos2 = pos2;
        this.val = val;
        this.address = address;
    }
    get_pos1() { return this.pos1; }
    get_pos2() { return this.pos2; }
    get_val() { return this.val; }
    get_address() { return this.address; }
}

let p = [
    new Point(43.297226, 76.861309, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.204335, 76.777238, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.169492, 76.850225, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.278782, 76.903253, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.232662, 76.799731, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.27117209507956, 76.9932034179683, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.290525, 76.838332, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.194258, 76.909842, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.263815, 76.817484, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.255315, 76.943248, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.18626, 76.9635, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.335645, 76.91291, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.368574, 76.94701, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.317606, 76.910836, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.157562, 76.901093, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.24327, 76.959704, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.204256, 77.11619, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.227906, 76.959098, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.217803, 76.949411, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.347968, 76.841949, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.19987, 76.855338, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.212392, 76.968251, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
    new Point(43.233558, 76.954503, 0, "ул. Махамбета Утемисова, 109, микрорайон Шанырак-1, Алатауский район, Алматы"),
];


function change1() {
    markerLayer.clearLayers();
    L.marker([43.283953720516585, 76.92535749845905], { icon: recyclingIcon }).addTo(markerLayer)
        .bindPopup('Приём второсырья'); 
    L.marker([43.261456143423764, 76.91025129741219], { icon: recyclingIcon }).addTo(markerLayer)
        .bindPopup('KWS');
    L.marker([43.27395582411021, 76.92604414396118], { icon: recyclingIcon }).addTo(markerLayer)
        .bindPopup('KWS');
    L.marker([43.304444272522744, 76.77292219603154], { icon: recyclingIcon }).addTo(markerLayer)
        .bindPopup('Мусоросортировочный завод г. Алматы');
    L.marker([43.205426067135726, 76.88827864071895], { icon: recyclingIcon }).addTo(markerLayer)
        .bindPopup('Ecosen');
    L.marker([43.23314608360356, 76.76735291141935 ], { icon: recyclingIcon }).addTo(markerLayer)
        .bindPopup('Kagazy Recycling');
    L.marker([43.2737436505289, 76.85414305088126], { icon: recyclingIcon }).addTo(markerLayer)
        .bindPopup('KазМакТрейд');
    L.marker([43.29246747557126, 76.98524709977133], { icon: recyclingIcon }).addTo(markerLayer)
        .bindPopup('NewCapitalCompany');
    L.marker([43.308632965342305, 76.9205917709952], { icon: recyclingIcon}).addTo(markerLayer)
        .bindPopup('EcoLog Kazakhstan');
    L.marker([43.391937342125935, 76.9563647151345], { icon: recyclingIcon}).addTo(markerLayer)
        .bindPopup('Экопост №1');
    L.marker([43.301790291257724, 77.00674953702753], { icon: recyclingIcon}).addTo(markerLayer)
        .bindPopup('Экопост №2');
}

function change2() {
    markerLayer.clearLayers();  
    for(let i = 0; i < p.length; i++){
        L.marker([p[i].get_pos1(), p[i].get_pos2()], {icon: circleIcon}).addTo(markerLayer);    
    }
}

document.getElementById('btn1').addEventListener('click', change1);
document.getElementById('btn2').addEventListener('click', change2);

